cats99_project/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2015-01-02' OR end_date < '2015-01-01') AND "cat_rental_requests"."status" = $3 LIMIT $4  [["cat_id", 1], ["id", 4], ["status", "APPROVED"], ["LIMIT", 1]]
---
    def does_not_overlap_approved_request
        # debugger
       if self.overlapping_approved_requests.exists? && self.status != 'DENIED'

SELECT "cat_rental_requests"."id" FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2015-02-27' OR end_date < '2015-02-22') AND "cat_rental_requests"."status" = $3  [["cat_id", 1], ["id", 29], ["status", "PENDING"]]
---
    def overlapping_pending_requests
        self.overlapping_requests.where(status: 'PENDING')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-02-07 01:58:42.683792"], ["id", 4]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-02-07 13:56:20.775422"], ["id", 2]]
---
    def approve!
        ActiveRecord::Base.transaction do
            self.status = 'APPROVED'
            self.save!
            self.overlapping_pending_requests.each do |request|
                request.status = 'DENIED'
                request.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-02-07 13:57:21.912025"], ["id", 1]]
---
    def deny!
        self.status = 'DENIED'
        self.save!