cats99_project/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 1]]
---
            <td>
                <% @cat.cat_rental_requests.order(:start_date).each do |request| %>