cats99_project/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "1982-12-08"], ["end_date", "1982-12-09"], ["created_at", "2021-02-06 21:33:06.705561"], ["updated_at", "2021-02-06 21:33:06.705561"]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def create
        @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
        if @cat_rental_request.save
            redirect_to cat_url(Cat.find_by(id: @cat_rental_request.cat_id))

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
    def approve
        @cat_rental_request = CatRentalRequest.includes(:cat).find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
    def deny
        @cat_rental_request = CatRentalRequest.includes(:cat).find(params[:id])