cats99_project/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" ORDER BY "cats"."id" ASC
---
    def index
        @cats = Cat.all.order(:id)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "        phat & ugly\r\n    "], ["updated_at", "2021-02-06 22:26:03.933068"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)