cats99_project/app/views/cat_rental_requests/new.html.erb

        <option value="Select a cat" selected disabled>Select a cat</option>
        <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"